<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/c23ea4a6-6ef9-4105-bd09-9ed219ea49c2/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.database_cluster.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                  = "staging-push-database"
        tags                                = {}
        # (41 unchanged attributes hidden)

      ~ serverlessv2_scaling_configuration {
          ~ max_capacity = 10 -> 20
          ~ min_capacity = 2 -> 0.5
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"
        name                               = "staging-push-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:160" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:160" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ cpu                      = "512" -> "256" # forces replacement
      ~ id                       = "staging-push" -> (known after apply)
      ~ memory                   = "1024" -> "512" # forces replacement
      ~ revision                 = 160 -> (known after apply)
      - tags                     = {} -> null
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tenant_database_cluster.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                  = "staging-push-tenant-database"
        tags                                = {}
        # (41 unchanged attributes hidden)

      ~ serverlessv2_scaling_configuration {
          ~ max_capacity = 10 -> 20
          ~ min_capacity = 2 -> 0.5
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.database_cluster.aws_rds_cluster.this[0] will be updated in-place%0A  ~ resource "aws_rds_cluster" "this" {%0A        id                                  = "staging-push-database"%0A        tags                                = {}%0A        # (41 unchanged attributes hidden)%0A%0A      ~ serverlessv2_scaling_configuration {%0A          ~ max_capacity = 10 -> 20%0A          ~ min_capacity = 2 -> 0.5%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"%0A        name                               = "staging-push-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:160" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:160" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ cpu                      = "512" -> "256" # forces replacement%0A      ~ id                       = "staging-push" -> (known after apply)%0A      ~ memory                   = "1024" -> "512" # forces replacement%0A      ~ revision                 = 160 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (7 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.tenant_database_cluster.aws_rds_cluster.this[0] will be updated in-place%0A  ~ resource "aws_rds_cluster" "this" {%0A        id                                  = "staging-push-tenant-database"%0A        tags                                = {}%0A        # (41 unchanged attributes hidden)%0A%0A      ~ serverlessv2_scaling_configuration {%0A          ~ max_capacity = 10 -> 20%0A          ~ min_capacity = 2 -> 0.5%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 1 to add, 3 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*